hanuka24/msp430fr5994-examples-cmake/RFM95/sx1276.c
      sx1276_write(REG_RXBW,  sx1276_get_fsk_bandwidthregvalue(bandwidth));
      sx1276_write(REG_AFCBW, sx1276_get_fsk_bandwidthregvalue(bandwidthAfc));

      sx1276_write(REG_PREAMBLEMSB, (uint8_t) ((preambleLen >> 8) & 0xFF));
      sx1276_write(REG_PREAMBLELSB, (uint8_t) (preambleLen & 0xFF));

      if(fixLen == 1) {
          sx1276_write(REG_PAYLOADLENGTH, payloadLen);
      } else {
          sx1276_write(REG_PAYLOADLENGTH, 0xFF); // Set payload length to the maximum
      }

      sx1276_write(REG_PACKETCONFIG1,
                     (sx1276_read(REG_PACKETCONFIG1) & RF_PACKETCONFIG1_CRC_MASK & RF_PACKETCONFIG1_PACKETFORMAT_MASK) |
                     ((fixLen == 1) ? RF_PACKETCONFIG1_PACKETFORMAT_FIXED : RF_PACKETCONFIG1_PACKETFORMAT_VARIABLE) |
                     (crcOn << 4));
    }
    break;
    case MODEM_LORA: {
      if( bandwidth > 2 ) {
          // Fatal error: When using LoRa modem only bandwidths 125, 250 and 500 kHz are supported
          while( 1 );
      }
      bandwidth += 7;

      sx1276.Settings.LoRa.Bandwidth =     bandwidth;
      sx1276.Settings.LoRa.Datarate =      datarate;
      sx1276.Settings.LoRa.Coderate =      coderate;
      sx1276.Settings.LoRa.PreambleLen =   preambleLen;
      sx1276.Settings.LoRa.FixLen =        fixLen;
      sx1276.Settings.LoRa.PayloadLen =    payloadLen;
      sx1276.Settings.LoRa.CrcOn =         crcOn;
      sx1276.Settings.LoRa.FreqHopOn =     freqHopOn;
      sx1276.Settings.LoRa.HopPeriod =     hopPeriod;
      sx1276.Settings.LoRa.IqInverted =    iqInverted;
      sx1276.Settings.LoRa.RxContinuous =  rxContinuous;

      if(datarate > 12)     datarate = 12;
      else if(datarate < 6) datarate = 6;


      if(((bandwidth == 7) && ((datarate == 11) || (datarate == 12))) || ((bandwidth == 8) && (datarate == 12))) {
          sx1276.Settings.LoRa.LowDatarateOptimize = 0x01;
      } else {
          sx1276.Settings.LoRa.LowDatarateOptimize = 0x00;
      }

      sx1276_write(REG_LR_MODEMCONFIG1,
                     (sx1276_read(REG_LR_MODEMCONFIG1) & RFLR_MODEMCONFIG1_BW_MASK & RFLR_MODEMCONFIG1_CODINGRATE_MASK & RFLR_MODEMCONFIG1_IMPLICITHEADER_MASK) |
                     (bandwidth << 4) | (coderate << 1) |
                     fixLen);

      sx1276_write(REG_LR_MODEMCONFIG2,
                     (sx1276_read(REG_LR_MODEMCONFIG2) & RFLR_MODEMCONFIG2_SF_MASK & RFLR_MODEMCONFIG2_RXPAYLOADCRC_MASK & RFLR_MODEMCONFIG2_SYMBTIMEOUTMSB_MASK) |
                     (datarate << 4) | (crcOn << 2) |
                     ((symbTimeout >> 8) & ~RFLR_MODEMCONFIG2_SYMBTIMEOUTMSB_MASK));

      sx1276_write(REG_LR_MODEMCONFIG3,
                     (sx1276_read(REG_LR_MODEMCONFIG3) & RFLR_MODEMCONFIG3_LOWDATARATEOPTIMIZE_MASK) |
                     (sx1276.Settings.LoRa.LowDatarateOptimize << 3));

      sx1276_write(REG_LR_SYMBTIMEOUTLSB, (uint8_t) (symbTimeout & 0xFF));

      sx1276_write(REG_LR_PREAMBLEMSB, (uint8_t) ((preambleLen >> 8 ) & 0xFF));
      sx1276_write(REG_LR_PREAMBLELSB, (uint8_t) ((preambleLen      ) & 0xFF));

      if(fixLen == 1) sx1276_write(REG_LR_PAYLOADLENGTH, payloadLen);


      if(sx1276.Settings.LoRa.FreqHopOn == true ) {
          sx1276_write(REG_LR_PLLHOP, (sx1276_read(REG_LR_PLLHOP) & RFLR_PLLHOP_FASTHOP_MASK) | RFLR_PLLHOP_FASTHOP_ON);
          sx1276_write(REG_LR_HOPPERIOD, sx1276.Settings.LoRa.HopPeriod);
      }

      if((bandwidth == 9) && (sx1276.Settings.Channel > RF_MID_BAND_THRESH)) {
          // ERRATA 2.1 - Sensitivity Optimization with a 500 kHz Bandwidth
          sx1276_write(REG_LR_TEST36, 0x02);
          sx1276_write(REG_LR_TEST3A, 0x64);
      } else if(bandwidth == 9) {
          // ERRATA 2.1 - Sensitivity Optimization with a 500 kHz Bandwidth
          sx1276_write(REG_LR_TEST36, 0x02);
          sx1276_write(REG_LR_TEST3A, 0x7F);
      } else {
          // ERRATA 2.1 - Sensitivity Optimization with a 500 kHz Bandwidth
          sx1276_write(REG_LR_TEST36, 0x03);
      }

      if( datarate == 6 ) {
          sx1276_write(REG_LR_DETECTOPTIMIZE,
                         (sx1276_read(REG_LR_DETECTOPTIMIZE) & RFLR_DETECTIONOPTIMIZE_MASK) |
                         RFLR_DETECTIONOPTIMIZE_SF6);
          sx1276_write(REG_LR_DETECTIONTHRESHOLD, RFLR_DETECTIONTHRESH_SF6);
      } else {
          sx1276_write(REG_LR_DETECTOPTIMIZE,
                       (sx1276_read(REG_LR_DETECTOPTIMIZE) & RFLR_DETECTIONOPTIMIZE_MASK) |
                       RFLR_DETECTIONOPTIMIZE_SF7_TO_SF12);
          sx1276_write( REG_LR_DETECTIONTHRESHOLD, RFLR_DETECTIONTHRESH_SF7_TO_SF12);
      }
    }
    break;
  }
}

void sx1276_set_txconfig(radio_modem_t modem, int8_t power, uint32_t fdev,
                        uint32_t bandwidth, uint32_t datarate,
                        uint8_t coderate, uint16_t preambleLen,
                        bool fixLen, bool crcOn, bool freqHopOn,
                        uint8_t hopPeriod, bool iqInverted, uint32_t timeout) {
  uint8_t paConfig = 0;
  uint8_t paDac = 0;

  sx1276_set_modem(modem);

  paConfig = sx1276_read(REG_PACONFIG);
  paDac =    sx1276_read(REG_PADAC);

  paConfig = (paConfig & RF_PACONFIG_PASELECT_MASK)  | sx1276_get_paselect(sx1276.Settings.Channel);
  paConfig = (paConfig & RF_PACONFIG_MAX_POWER_MASK) | 0x70;

  if((paConfig & RF_PACONFIG_PASELECT_PABOOST) == RF_PACONFIG_PASELECT_PABOOST) {
    if(power > 17) paDac = (paDac & RF_PADAC_20DBM_MASK) | RF_PADAC_20DBM_ON;
    else           paDac = (paDac & RF_PADAC_20DBM_MASK) | RF_PADAC_20DBM_OFF;

    if((paDac & RF_PADAC_20DBM_ON) == RF_PADAC_20DBM_ON) {
      if(power < 5)  power = 5;
      if(power > 20) power = 20;
      paConfig = (paConfig & RF_PACONFIG_OUTPUTPOWER_MASK) | (uint8_t) ((uint16_t) (power - 5) & 0x0F);
    } else {
      if( power < 2 ) power = 2;
      if( power > 17 ) power = 17;
      paConfig = (paConfig & RF_PACONFIG_OUTPUTPOWER_MASK) | (uint8_t) ((uint16_t) (power - 2) & 0x0F);
    }
  } else {
    if( power < -1 ) power = -1;
    if( power > 14 ) power = 14;
    paConfig = (paConfig & RF_PACONFIG_OUTPUTPOWER_MASK) | (uint8_t) ((uint16_t) (power + 1) & 0x0F);
  }

  sx1276_write(REG_PACONFIG, paConfig);
  sx1276_write(REG_PADAC, paDac);

  switch(modem ) {
    case MODEM_FSK: {
      sx1276.Settings.Fsk.Power =        power;
      sx1276.Settings.Fsk.Fdev =         fdev;
      sx1276.Settings.Fsk.Bandwidth =    bandwidth;
      sx1276.Settings.Fsk.Datarate =     datarate;
      sx1276.Settings.Fsk.PreambleLen =  preambleLen;
      sx1276.Settings.Fsk.FixLen =       fixLen;
      sx1276.Settings.Fsk.CrcOn =        crcOn;
      sx1276.Settings.Fsk.IqInverted =   iqInverted;
      sx1276.Settings.Fsk.TxTimeout =    timeout;

      fdev = (uint16_t) ((double) fdev / (double) FREQ_STEP);
      sx1276_write(REG_FDEVMSB, (uint8_t) (fdev >> 8));
      sx1276_write(REG_FDEVLSB, (uint8_t) (fdev & 0xFF));

      datarate = (uint16_t) ((double) XTAL_FREQ / (double) datarate);
      sx1276_write(REG_BITRATEMSB, (uint8_t) (datarate >> 8));
      sx1276_write(REG_BITRATELSB, (uint8_t) (datarate & 0xFF));

      sx1276_write(REG_PREAMBLEMSB, (preambleLen >> 8) & 0x00FF);
      sx1276_write(REG_PREAMBLELSB, (preambleLen     ) & 0xFF);

      sx1276_write(REG_PACKETCONFIG1,
                     (sx1276_read(REG_PACKETCONFIG1) & RF_PACKETCONFIG1_CRC_MASK & RF_PACKETCONFIG1_PACKETFORMAT_MASK) |
                     ((fixLen == 1) ? RF_PACKETCONFIG1_PACKETFORMAT_FIXED : RF_PACKETCONFIG1_PACKETFORMAT_VARIABLE) |
                     (crcOn << 4));

