hanuka24/msp430fr5994-examples-cmake/RFM95/sx1276.c
    }
    break;
    case MODEM_LORA: {
      sx1276.Settings.LoRa.Power = power;

      if( bandwidth > 2 ) {
        // Fatal error: When using LoRa modem only bandwidths 125, 250 and 500 kHz are supported
        while( 1 );
      }
      bandwidth += 7;

      sx1276.Settings.LoRa.Bandwidth =    bandwidth;
      sx1276.Settings.LoRa.Datarate =     datarate;
      sx1276.Settings.LoRa.Coderate =     coderate;
      sx1276.Settings.LoRa.PreambleLen =  preambleLen;
      sx1276.Settings.LoRa.FixLen =       fixLen;
      sx1276.Settings.LoRa.FreqHopOn =    freqHopOn;
      sx1276.Settings.LoRa.HopPeriod =    hopPeriod;
      sx1276.Settings.LoRa.CrcOn =        crcOn;
      sx1276.Settings.LoRa.IqInverted =   iqInverted;
      sx1276.Settings.LoRa.TxTimeout =    timeout;

      if(datarate > 12)     datarate = 12;
      else if(datarate < 6) datarate = 6;

      if(((bandwidth == 7) && ((datarate == 11) || (datarate == 12))) || ((bandwidth == 8) && (datarate == 12))) {
        sx1276.Settings.LoRa.LowDatarateOptimize = 0x01;
      } else {
        sx1276.Settings.LoRa.LowDatarateOptimize = 0x00;
      }

      if(sx1276.Settings.LoRa.FreqHopOn == true) {
        sx1276_write(REG_LR_PLLHOP, (sx1276_read(REG_LR_PLLHOP) & RFLR_PLLHOP_FASTHOP_MASK) | RFLR_PLLHOP_FASTHOP_ON);
        sx1276_write(REG_LR_HOPPERIOD, sx1276.Settings.LoRa.HopPeriod);
      }

      sx1276_write(REG_LR_MODEMCONFIG1,
                     (sx1276_read(REG_LR_MODEMCONFIG1) & RFLR_MODEMCONFIG1_BW_MASK &  RFLR_MODEMCONFIG1_CODINGRATE_MASK & RFLR_MODEMCONFIG1_IMPLICITHEADER_MASK) |
                     (bandwidth << 4) | (coderate << 1) |
                     fixLen);

      sx1276_write(REG_LR_MODEMCONFIG2,
                     (sx1276_read(REG_LR_MODEMCONFIG2) & RFLR_MODEMCONFIG2_SF_MASK & RFLR_MODEMCONFIG2_RXPAYLOADCRC_MASK) |
                     (datarate << 4) | (crcOn << 2));

      sx1276_write(REG_LR_MODEMCONFIG3,
                     (sx1276_read( REG_LR_MODEMCONFIG3 ) & RFLR_MODEMCONFIG3_LOWDATARATEOPTIMIZE_MASK ) |
                     (sx1276.Settings.LoRa.LowDatarateOptimize << 3));

      sx1276_write(REG_LR_PREAMBLEMSB, (preambleLen >> 8) & 0x00FF);
      sx1276_write(REG_LR_PREAMBLELSB, (preambleLen     ) & 0xFF);

      if(datarate == 6) {
        sx1276_write(REG_LR_DETECTOPTIMIZE,
                       (sx1276_read(REG_LR_DETECTOPTIMIZE) & RFLR_DETECTIONOPTIMIZE_MASK) |
                       RFLR_DETECTIONOPTIMIZE_SF6);
        sx1276_write(REG_LR_DETECTIONTHRESHOLD, RFLR_DETECTIONTHRESH_SF6);
      } else {
        sx1276_write(REG_LR_DETECTOPTIMIZE,
                     (sx1276_read(REG_LR_DETECTOPTIMIZE) & RFLR_DETECTIONOPTIMIZE_MASK) |
                     RFLR_DETECTIONOPTIMIZE_SF7_TO_SF12);
        sx1276_write(REG_LR_DETECTIONTHRESHOLD, RFLR_DETECTIONTHRESH_SF7_TO_SF12);
      }
    }
    break;
  }
}

uint32_t sx1276_get_timeonair(radio_modem_t modem, uint8_t pktLen) {
  uint32_t airTime = 0;
  switch( modem ) {
    case MODEM_FSK: {
    airTime = (uint32_t)((8 * (sx1276.Settings.Fsk.PreambleLen +
                             ((sx1276_read(REG_SYNCCONFIG) & ~RF_SYNCCONFIG_SYNCSIZE_MASK) + 1) +
                             ((sx1276.Settings.Fsk.FixLen == 0x01) ? 0.0 : 1.0) +
                             (((sx1276_read( REG_PACKETCONFIG1) & ~RF_PACKETCONFIG1_ADDRSFILTERING_MASK) != 0x00) ? 1.0 : 0) +
                             pktLen +
                             ((sx1276.Settings.Fsk.CrcOn == 0x01) ? 2.0 : 0)) / sx1276.Settings.Fsk.Datarate) * 1e3);
    }
    break;
    case MODEM_LORA: {
      double bw = 0.0;
      // REMARK: When using LoRa modem only bandwidths 125, 250 and 500 kHz are supported
      switch(sx1276.Settings.LoRa.Bandwidth) {
        case 7: // 125 kHz
          bw = 125e3;
          break;
        case 8: // 250 kHz
          bw = 250e3;
          break;
        case 9: // 500 kHz
          bw = 500e3;
          break;
      }

      // Symbol rate : time for one symbol (secs)
      double rs = bw / (1 << sx1276.Settings.LoRa.Datarate);
      double ts = 1 / rs;
      // time of preamble
      double tPreamble = (sx1276.Settings.LoRa.PreambleLen + 4.25) * ts;
      // Symbol length of payload and time
      double tmp = (double)(int)((8 * pktLen - 4 * sx1276.Settings.LoRa.Datarate +
                           28 + 16 * sx1276.Settings.LoRa.CrcOn -
                           ( sx1276.Settings.LoRa.FixLen ? 20 : 0 ) ) /
                           ( double )( 4 * sx1276.Settings.LoRa.Datarate -
                           ( ( sx1276.Settings.LoRa.LowDatarateOptimize > 0 ) ? 2 : 0 ) ) ) *
                           ( sx1276.Settings.LoRa.Coderate + 4 );
      double nPayload = 8 + ( ( tmp > 0 ) ? tmp : 0 );
      double tPayload = nPayload * ts;
      // Time on air
      double tOnAir = tPreamble + tPayload;
      // return us secs
      airTime = (uint32_t)( tOnAir * 1e3 + 0.999 );
    }
    break;
  }
  return airTime;
}

void sx1276_send(uint8_t *buffer, uint8_t size) {
  uint32_t txTimeout = 0;

  switch( sx1276.Settings.Modem ) {
    case MODEM_FSK: {
      sx1276.Settings.FskPacketHandler.NbBytes = 0;
      sx1276.Settings.FskPacketHandler.Size = size;

      if(sx1276.Settings.Fsk.FixLen == false) {
        sx1276_write_fifo((uint8_t*) &size, 1);
      } else {
        sx1276_write(REG_PAYLOADLENGTH, size);
      }

      if((size > 0) && (size <= 64)) {
        sx1276.Settings.FskPacketHandler.ChunkSize = size;
      } else {
        mcu_memcpy1(RxTxBuffer, buffer, size);
        sx1276.Settings.FskPacketHandler.ChunkSize = 32;
      }

      // Write payload buffer
      sx1276_write_fifo(buffer, sx1276.Settings.FskPacketHandler.ChunkSize);
      sx1276.Settings.FskPacketHandler.NbBytes += sx1276.Settings.FskPacketHandler.ChunkSize;
      txTimeout = sx1276.Settings.Fsk.TxTimeout;
    }
    break;
    case MODEM_LORA: {
      if( sx1276.Settings.LoRa.IqInverted == true ) {
        sx1276_write(REG_LR_INVERTIQ, ((sx1276_read(REG_LR_INVERTIQ) & RFLR_INVERTIQ_TX_MASK & RFLR_INVERTIQ_RX_MASK) | RFLR_INVERTIQ_RX_OFF | RFLR_INVERTIQ_TX_ON));
        sx1276_write(REG_LR_INVERTIQ2, RFLR_INVERTIQ2_ON );
      } else {
        sx1276_write(REG_LR_INVERTIQ, ((sx1276_read(REG_LR_INVERTIQ) & RFLR_INVERTIQ_TX_MASK & RFLR_INVERTIQ_RX_MASK) | RFLR_INVERTIQ_RX_OFF | RFLR_INVERTIQ_TX_OFF));
        sx1276_write(REG_LR_INVERTIQ2, RFLR_INVERTIQ2_OFF );
      }

      sx1276.Settings.LoRaPacketHandler.Size = size;

