hanuka24/msp430fr5994-examples-cmake/RFM95/sx1276.c
      //FIFO operations can not take place in Sleep mode
      if((sx1276_read(REG_OPMODE) & ~RF_OPMODE_MASK) == RF_OPMODE_SLEEP) {
        sx1276_set_opmode(RF_OPMODE_TRANSMITTER);
        sx1276.Settings.State = RF_TX_RUNNING;
        while((sx1276_read(REG_OPMODE) & ~RF_OPMODE_MASK) == RF_OPMODE_SLEEP)
        {};
      }

      // Full buffer used for Tx
      sx1276_write(REG_LR_FIFOTXBASEADDR, 0);
      sx1276_write(REG_LR_FIFOADDRPTR, 0x00);
      
      // Write payload buffer
      sx1276_write_fifo( buffer, size );
      txTimeout = sx1276.Settings.LoRa.TxTimeout;
      // Initializes the payload size
      sx1276_write(REG_LR_PAYLOADLENGTH, size);
    }
    break;
  }
  
  sx1276_set_tx(txTimeout );
}

void sx1276_set_rx(uint32_t timeout) {
  int8_t rxContinuous = false;

  switch( sx1276.Settings.Modem ) {
    case MODEM_FSK: {
      rxContinuous = sx1276.Settings.Fsk.RxContinuous;

      // DIO0=PayloadReady
      // DIO1=FifoLevel
      // DIO2=SyncAddr
      // DIO3=FifoEmpty
      // DIO4=Preamble
      // DIO5=ModeReady
      sx1276_write(REG_DIOMAPPING1, (sx1276_read(REG_DIOMAPPING1) & RF_DIOMAPPING1_DIO0_MASK &
                                                                     RF_DIOMAPPING1_DIO1_MASK &
                                                                     RF_DIOMAPPING1_DIO2_MASK) |
                                                                     RF_DIOMAPPING1_DIO0_00 |
                                                                     RF_DIOMAPPING1_DIO1_00 |
                                                                     RF_DIOMAPPING1_DIO2_11);

      sx1276_write(REG_DIOMAPPING2, (sx1276_read(REG_DIOMAPPING2) & RF_DIOMAPPING2_DIO4_MASK &
                                                                     RF_DIOMAPPING2_MAP_MASK) |
                                                                     RF_DIOMAPPING2_DIO4_11 |
                                                                     RF_DIOMAPPING2_MAP_PREAMBLEDETECT);

      sx1276.Settings.FskPacketHandler.FifoThresh = sx1276_read(REG_FIFOTHRESH) & 0x3F;

      sx1276_write(REG_RXCONFIG, RF_RXCONFIG_AFCAUTO_ON | RF_RXCONFIG_AGCAUTO_ON | RF_RXCONFIG_RXTRIGER_PREAMBLEDETECT);

      sx1276.Settings.FskPacketHandler.PreambleDetected = false;
      sx1276.Settings.FskPacketHandler.SyncWordDetected = false;
      sx1276.Settings.FskPacketHandler.NbBytes = 0;
      sx1276.Settings.FskPacketHandler.Size = 0;
    }
    break;
    case MODEM_LORA: {
      if(sx1276.Settings.LoRa.IqInverted == true) {
          sx1276_write(REG_LR_INVERTIQ, ((sx1276_read(REG_LR_INVERTIQ) & RFLR_INVERTIQ_TX_MASK & RFLR_INVERTIQ_RX_MASK) | RFLR_INVERTIQ_RX_ON | RFLR_INVERTIQ_TX_OFF));
          sx1276_write(REG_LR_INVERTIQ2, RFLR_INVERTIQ2_ON);
      } else {
          sx1276_write(REG_LR_INVERTIQ, ((sx1276_read(REG_LR_INVERTIQ) & RFLR_INVERTIQ_TX_MASK & RFLR_INVERTIQ_RX_MASK) | RFLR_INVERTIQ_RX_OFF | RFLR_INVERTIQ_TX_OFF));
          sx1276_write(REG_LR_INVERTIQ2, RFLR_INVERTIQ2_OFF);
      }

      // ERRATA 2.3 - Receiver Spurious Reception of a LoRa Signal
      if(sx1276.Settings.LoRa.Bandwidth < 9) {
          sx1276_write(REG_LR_DETECTOPTIMIZE, sx1276_read(REG_LR_DETECTOPTIMIZE) & 0x7F );
          sx1276_write(REG_LR_TEST30, 0x00);
          switch(sx1276.Settings.LoRa.Bandwidth) {
            case 0: // 7.8 kHz
              sx1276_write( REG_LR_TEST2F, 0x48 );
              sx1276_set_channel(sx1276.Settings.Channel + 7.81e3 );
              break;
            case 1: // 10.4 kHz
              sx1276_write( REG_LR_TEST2F, 0x44 );
              sx1276_set_channel(sx1276.Settings.Channel + 10.42e3 );
              break;
            case 2: // 15.6 kHz
              sx1276_write( REG_LR_TEST2F, 0x44 );
              sx1276_set_channel(sx1276.Settings.Channel + 15.62e3 );
              break;
            case 3: // 20.8 kHz
              sx1276_write( REG_LR_TEST2F, 0x44 );
              sx1276_set_channel(sx1276.Settings.Channel + 20.83e3 );
              break;
            case 4: // 31.2 kHz
              sx1276_write( REG_LR_TEST2F, 0x44 );
              sx1276_set_channel(sx1276.Settings.Channel + 31.25e3 );
              break;
            case 5: // 41.4 kHz
              sx1276_write( REG_LR_TEST2F, 0x44 );
              sx1276_set_channel(sx1276.Settings.Channel + 41.67e3 );
              break;
            case 6: // 62.5 kHz
              //sx1276_write( REG_LR_TEST2F, 0x40 );
              break;
            case 7: // 125 kHz
              //sx1276_write( REG_LR_TEST2F, 0x40 );
              break;
            case 8: // 250 kHz
              //sx1276_write( REG_LR_TEST2F, 0x40 );
              break;
          }
      } else {
          sx1276_write(REG_LR_DETECTOPTIMIZE, sx1276_read(REG_LR_DETECTOPTIMIZE) | 0x80);
      }

      rxContinuous = sx1276.Settings.LoRa.RxContinuous;

      if(sx1276.Settings.LoRa.FreqHopOn == true) {
          sx1276_write( REG_LR_IRQFLAGSMASK, //RFLR_IRQFLAGS_RXTIMEOUT |
                                            //RFLR_IRQFLAGS_RXDONE |
                                            //RFLR_IRQFLAGS_PAYLOADCRCERROR |
                                            RFLR_IRQFLAGS_VALIDHEADER |
                                            RFLR_IRQFLAGS_TXDONE |
                                            RFLR_IRQFLAGS_CADDONE |
                                            //RFLR_IRQFLAGS_FHSSCHANGEDCHANNEL |
                                            RFLR_IRQFLAGS_CADDETECTED );

          // DIO0=RxDone, DIO2=FhssChangeChannel
          sx1276_write(REG_DIOMAPPING1, (sx1276_read(REG_DIOMAPPING1) & RFLR_DIOMAPPING1_DIO0_MASK & RFLR_DIOMAPPING1_DIO2_MASK) | RFLR_DIOMAPPING1_DIO0_00 | RFLR_DIOMAPPING1_DIO2_00);
      } else {
          sx1276_write(REG_LR_IRQFLAGSMASK, //RFLR_IRQFLAGS_RXTIMEOUT |
                                           //RFLR_IRQFLAGS_RXDONE |
                                           //RFLR_IRQFLAGS_PAYLOADCRCERROR |
                                           RFLR_IRQFLAGS_VALIDHEADER |
                                           RFLR_IRQFLAGS_TXDONE |
                                           RFLR_IRQFLAGS_CADDONE |
                                           RFLR_IRQFLAGS_FHSSCHANGEDCHANNEL |
                                           RFLR_IRQFLAGS_CADDETECTED);

