hanuka24/msp430fr5994-examples-cmake/RFM95/sx1276.c
          // DIO0=RxDone
          sx1276_write(REG_DIOMAPPING1, (sx1276_read(REG_DIOMAPPING1) & RFLR_DIOMAPPING1_DIO0_MASK) | RFLR_DIOMAPPING1_DIO0_00);
      }
      sx1276_write(REG_LR_FIFORXBASEADDR, 0);
      sx1276_write(REG_LR_FIFOADDRPTR, 0);
    }
    break;
  }

  memset(RxTxBuffer, 0, (uint32_t) RX_BUFFER_SIZE );

  sx1276.Settings.State = RF_RX_RUNNING;
  if(timeout != 0) {
    //TimerSetValue( &RxTimeoutTimer, timeout );
    //TimerStart( &RxTimeoutTimer );
  }

  if(sx1276.Settings.Modem == MODEM_FSK) {
    sx1276_set_opmode(RF_OPMODE_RECEIVER);

    if(rxContinuous == false) {
      //TimerSetValue( &RxTimeoutSyncWord, ceil( ( 8.0 * ( sx1276.Settings.Fsk.PreambleLen +
      //                                                 ( ( SX1276Read( REG_SYNCCONFIG ) &
      //                                                    ~RF_SYNCCONFIG_SYNCSIZE_MASK ) +
      //                                                    1.0 ) + 10.0 ) /
      //                                                 ( double )sx1276.Settings.Fsk.Datarate ) * 1e3 ) + 4 );
      //TimerStart( &RxTimeoutSyncWord );
    }
  } else {
    if(rxContinuous == true) {
      sx1276_set_opmode(RFLR_OPMODE_RECEIVER);
    } else {
      sx1276_set_opmode(RFLR_OPMODE_RECEIVER_SINGLE);
    }
  }
}

void sx1276_set_tx(uint32_t timeout) {
  //TimerSetValue( &TxTimeoutTimer, timeout );

  switch( sx1276.Settings.Modem ) {
    case MODEM_FSK: {
      // DIO0=PacketSent
      // DIO1=FifoEmpty
      // DIO2=FifoFull
      // DIO3=FifoEmpty
      // DIO4=LowBat
      // DIO5=ModeReady
      sx1276_write(REG_DIOMAPPING1, (sx1276_read(REG_DIOMAPPING1) & RF_DIOMAPPING1_DIO0_MASK & RF_DIOMAPPING1_DIO1_MASK & RF_DIOMAPPING1_DIO2_MASK) | RF_DIOMAPPING1_DIO1_01);
      sx1276_write(REG_DIOMAPPING2, (sx1276_read(REG_DIOMAPPING2) & RF_DIOMAPPING2_DIO4_MASK & RF_DIOMAPPING2_MAP_MASK));
      sx1276.Settings.FskPacketHandler.FifoThresh = sx1276_read( REG_FIFOTHRESH ) & 0x3F;
    }
    break;
    case MODEM_LORA: {
      if(sx1276.Settings.LoRa.FreqHopOn == true) {
        sx1276_write(REG_LR_IRQFLAGSMASK, RFLR_IRQFLAGS_RXTIMEOUT |
                                         RFLR_IRQFLAGS_RXDONE |
                                         RFLR_IRQFLAGS_PAYLOADCRCERROR |
                                         RFLR_IRQFLAGS_VALIDHEADER |
                                         //RFLR_IRQFLAGS_TXDONE |
                                         RFLR_IRQFLAGS_CADDONE |
                                         //RFLR_IRQFLAGS_FHSSCHANGEDCHANNEL |
                                         RFLR_IRQFLAGS_CADDETECTED);

        // DIO0=TxDone, DIO2=FhssChangeChannel
        sx1276_write(REG_DIOMAPPING1, (sx1276_read(REG_DIOMAPPING1) & RFLR_DIOMAPPING1_DIO0_MASK & RFLR_DIOMAPPING1_DIO2_MASK) | RFLR_DIOMAPPING1_DIO0_01 | RFLR_DIOMAPPING1_DIO2_00);
      } else {
        
        sx1276_write(REG_LR_IRQFLAGSMASK, RFLR_IRQFLAGS_RXTIMEOUT |
                                          RFLR_IRQFLAGS_RXDONE |
                                          RFLR_IRQFLAGS_PAYLOADCRCERROR |
                                          RFLR_IRQFLAGS_VALIDHEADER |
                                          //RFLR_IRQFLAGS_TXDONE |
                                          RFLR_IRQFLAGS_CADDONE |
                                          RFLR_IRQFLAGS_FHSSCHANGEDCHANNEL |
                                          RFLR_IRQFLAGS_CADDETECTED );
                                          
        // DIO0=TxDone
        sx1276_write(REG_DIOMAPPING1, RFLR_DIOMAPPING1_DIO0_01);
      }
    }
    break;
  }

  sx1276.Settings.State = RF_TX_RUNNING;
  //TimerStart( &TxTimeoutTimer );
  
 // sx1276_write(REG_LR_IRQFLAGS, RFLR_IRQFLAGS_TXDONE);
 // sx1276_set_opmode(RF_OPMODE_TRANSMITTER);
}


void sx1276_set_channel(uint32_t freq) {
    sx1276.Settings.Channel = freq;
    freq = (uint32_t) ((double) freq / (double) FREQ_STEP);
    sx1276_write(REG_FRFMSB, (uint8_t) ((freq >> 16) & 0xFF));
    sx1276_write(REG_FRFMID, (uint8_t) ((freq >> 8 ) & 0xFF));
    sx1276_write(REG_FRFLSB, (uint8_t) ((freq      ) & 0xFF));
}

void sx1276_set_modem(radio_modem_t modem) {
  if(sx1276.Settings.Modem == modem) return;

  sx1276.Settings.Modem = modem;

  switch(sx1276.Settings.Modem) {
    default:
    case MODEM_FSK:
      sx1276_set_opmode(RF_OPMODE_SLEEP );
      sx1276_write(REG_OPMODE, (sx1276_read(REG_OPMODE) & RFLR_OPMODE_LONGRANGEMODE_MASK) | RFLR_OPMODE_LONGRANGEMODE_OFF);

      sx1276_write(REG_DIOMAPPING1, 0x00);
      sx1276_write(REG_DIOMAPPING2, 0x30); // DIO5=ModeReady
      break;
    case MODEM_LORA:
      sx1276_set_opmode(RF_OPMODE_SLEEP );
      sx1276_write(REG_OPMODE, (sx1276_read(REG_OPMODE) & RFLR_OPMODE_LONGRANGEMODE_MASK) | RFLR_OPMODE_LONGRANGEMODE_ON);

      sx1276_write(REG_DIOMAPPING1, 0x00);
      sx1276_write(REG_DIOMAPPING2, 0x00);
      break;
  }
}

void sx1276_set_opmode(uint8_t opmode) {
  sx1276_write(REG_OPMODE, (sx1276_read(REG_OPMODE) & RF_OPMODE_MASK) | opmode);
}

void sx1276_write(uint8_t addr, uint8_t data) {
  spi_chipEnable();

  spi_transfer(addr | 0x80);
  spi_transfer(data);

  spi_chipDisable();
}

void sx1276_write_buffer(uint8_t addr, uint8_t* data, uint8_t len) {
  if (len > 0) {
    spi_chipEnable();
    spi_send(addr | 0x80);

    while (len--) spi_send(*data++);

    spi_txready();

    spi_chipDisable();
  }
}

void sx1276_write_fifo(uint8_t *data, uint8_t len) {
  sx1276_write_buffer(0, data, len);
}

uint8_t sx1276_read(uint8_t addr) {
  spi_chipEnable();

  spi_transfer(addr & 0x7f);
  spi_transfer(0x00);

  uint8_t result = spi_buf;

  spi_chipDisable();

  return result;
}

void sx1276_read_buffer(uint8_t addr, uint8_t* data, uint8_t len) {
  if (len > 0) {
    spi_chipEnable();
    spi_send(addr & 0x7f);

    while (len--) {
      spi_transfer(0x00);
      *data++  = spi_buf;
    }

    spi_chipDisable();
  }
}

void sx1276_read_fifo(uint8_t *data, uint8_t len) {
  sx1276_read_buffer(0, data, len);
}

void sx1276_on_dio0irq() {
  volatile uint8_t irqFlags = 0;
  
  switch(sx1276.Settings.State) {
    case RF_RX_RUNNING:
      // // TimerStop( &RxTimeoutTimer );
      switch(sx1276.Settings.Modem) {
        case MODEM_FSK: {
          if(sx1276.Settings.Fsk.CrcOn == true) {
            irqFlags = sx1276_read( REG_IRQFLAGS2 );
            if((irqFlags & RF_IRQFLAGS2_CRCOK) != RF_IRQFLAGS2_CRCOK) {
              // Clear Irqs
              sx1276_write(REG_IRQFLAGS1, RF_IRQFLAGS1_RSSI | RF_IRQFLAGS1_PREAMBLEDETECT | RF_IRQFLAGS1_SYNCADDRESSMATCH);
              sx1276_write(REG_IRQFLAGS2, RF_IRQFLAGS2_FIFOOVERRUN);

              //TimerStop( &RxTimeoutTimer );

              if(sx1276.Settings.Fsk.RxContinuous == false) {
                //TimerStop( &RxTimeoutSyncWord );
                sx1276.Settings.State = RF_IDLE;
              } else {
                // Continuous mode restart Rx chain
                sx1276_write( REG_RXCONFIG, sx1276_read( REG_RXCONFIG ) | RF_RXCONFIG_RESTARTRXWITHOUTPLLLOCK );
                //TimerStart( &RxTimeoutSyncWord );
              }

              if((radio_events != 0) && (radio_events->RxError != 0) ) {
                  radio_events->RxError();
              }

