hanuka24/msp430fr5994-examples-cmake/RFM95/sx1276.c
              sx1276.Settings.FskPacketHandler.PreambleDetected = false;
              sx1276.Settings.FskPacketHandler.SyncWordDetected = false;
              sx1276.Settings.FskPacketHandler.NbBytes = 0;
              sx1276.Settings.FskPacketHandler.Size = 0;
              break;
            }
          }

          // Read received packet size
          if((sx1276.Settings.FskPacketHandler.Size == 0) && (sx1276.Settings.FskPacketHandler.NbBytes == 0)) {
            if(sx1276.Settings.Fsk.FixLen == false) {
                sx1276_read_fifo((uint8_t*) &sx1276.Settings.FskPacketHandler.Size, 1);
            } else {
                sx1276.Settings.FskPacketHandler.Size = sx1276_read(REG_PAYLOADLENGTH);
            }
            sx1276_read_fifo(RxTxBuffer + sx1276.Settings.FskPacketHandler.NbBytes, sx1276.Settings.FskPacketHandler.Size - sx1276.Settings.FskPacketHandler.NbBytes);
            sx1276.Settings.FskPacketHandler.NbBytes += (sx1276.Settings.FskPacketHandler.Size - sx1276.Settings.FskPacketHandler.NbBytes);
          } else {
            sx1276_read_fifo(RxTxBuffer + sx1276.Settings.FskPacketHandler.NbBytes, sx1276.Settings.FskPacketHandler.Size - sx1276.Settings.FskPacketHandler.NbBytes);
            sx1276.Settings.FskPacketHandler.NbBytes += (sx1276.Settings.FskPacketHandler.Size - sx1276.Settings.FskPacketHandler.NbBytes);
          }

          if(sx1276.Settings.Fsk.RxContinuous == false) {
            sx1276.Settings.State = RF_IDLE;
            //TimerStart( &RxTimeoutSyncWord );
          } else {
            // Continuous mode restart Rx chain
            sx1276_write(REG_RXCONFIG, sx1276_read(REG_RXCONFIG) | RF_RXCONFIG_RESTARTRXWITHOUTPLLLOCK);
          }
          //TimerStop( &RxTimeoutTimer );

          if((radio_events != 0) && (radio_events->RxDone != 0))   {
              radio_events->RxDone(RxTxBuffer, sx1276.Settings.FskPacketHandler.Size, sx1276.Settings.FskPacketHandler.RssiValue, 0);
          }

          sx1276.Settings.FskPacketHandler.PreambleDetected = false;
          sx1276.Settings.FskPacketHandler.SyncWordDetected = false;
          sx1276.Settings.FskPacketHandler.NbBytes = 0;
          sx1276.Settings.FskPacketHandler.Size = 0;
        }
        break;
        case MODEM_LORA: {
          int8_t snr = 0;

          // Clear Irq
          sx1276_write(REG_LR_IRQFLAGS, RFLR_IRQFLAGS_RXDONE);

          irqFlags = sx1276_read(REG_LR_IRQFLAGS);
          if((irqFlags & RFLR_IRQFLAGS_PAYLOADCRCERROR_MASK) == RFLR_IRQFLAGS_PAYLOADCRCERROR) {
            // Clear Irq
            sx1276_write(REG_LR_IRQFLAGS, RFLR_IRQFLAGS_PAYLOADCRCERROR);

            if(sx1276.Settings.LoRa.RxContinuous == false) {
              sx1276.Settings.State = RF_IDLE;
            }
            //TimerStop( &RxTimeoutTimer );

            if((radio_events != 0) && (radio_events->RxError != 0)) {
                radio_events->RxError();
            }

            break;
          }

          sx1276.Settings.LoRaPacketHandler.SnrValue = sx1276_read(REG_LR_PKTSNRVALUE);
          if(sx1276.Settings.LoRaPacketHandler.SnrValue & 0x80) { // The SNR sign bit is 1
            // Invert and divide by 4
            snr = ( ( ~sx1276.Settings.LoRaPacketHandler.SnrValue + 1 ) & 0xFF ) >> 2;
            snr = -snr;
          } else {
            // Divide by 4
            snr = ( sx1276.Settings.LoRaPacketHandler.SnrValue & 0xFF ) >> 2;
          }

          int16_t rssi = sx1276_read(REG_LR_PKTRSSIVALUE);
          if(snr < 0) {
            if(sx1276.Settings.Channel > RF_MID_BAND_THRESH) {
              sx1276.Settings.LoRaPacketHandler.RssiValue = RSSI_OFFSET_HF + rssi + (rssi >> 4) + snr;
            } else {
              sx1276.Settings.LoRaPacketHandler.RssiValue = RSSI_OFFSET_LF + rssi + (rssi >> 4) + snr;
            }
          } else {
            if(sx1276.Settings.Channel > RF_MID_BAND_THRESH) {
              sx1276.Settings.LoRaPacketHandler.RssiValue = RSSI_OFFSET_HF + rssi + (rssi >> 4);
            } else {
              sx1276.Settings.LoRaPacketHandler.RssiValue = RSSI_OFFSET_LF + rssi + (rssi >> 4);
            }
          }

          sx1276.Settings.LoRaPacketHandler.Size = sx1276_read(REG_LR_RXNBBYTES);
          sx1276_read_fifo(RxTxBuffer, sx1276.Settings.LoRaPacketHandler.Size);

          if(sx1276.Settings.LoRa.RxContinuous == false) {
            sx1276.Settings.State = RF_IDLE;
          }
          //TimerStop( &RxTimeoutTimer );

          if((radio_events != 0) && (radio_events->RxDone != 0)) {
            radio_events->RxDone(RxTxBuffer, sx1276.Settings.LoRaPacketHandler.Size, sx1276.Settings.LoRaPacketHandler.RssiValue, sx1276.Settings.LoRaPacketHandler.SnrValue);
          }
        }
        break;
        default:
        break;
      }
    break;
    case RF_TX_RUNNING:
//      P1OUT |= 0x01;
      //TimerStop( &TxTimeoutTimer );
      switch(sx1276.Settings.Modem) {
        case MODEM_LORA:

        case MODEM_FSK:
        default:
          break;
      }
        // Clear Irq
        sx1276.Settings.State = RF_IDLE;
        if((radio_events != 0) && (radio_events->TxDone != 0)) {
          radio_events->TxDone( );
        }
    break;
    default:
    break;
  }
}



#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector=PORT8_VECTOR
__interrupt
#elif defined(__GNUC__)
__attribute__((interrupt(PORT8_VECTOR)))
#endif
void Port_8 (void) {

    if((P8IFG & GPIO_PIN3))
    {
      sx1276_write(REG_LR_IRQFLAGS, RFLR_IRQFLAGS_TXDONE);
      sx1276_on_dio0irq();
    }
    GPIO_clearInterrupt(GPIO_PORT_P8, 0xFF);
}
